/*

  1번 수포자 : 1,,2,3,4,5,1,2,3,4,5 ... (length : 5 , 1 > 5 순서대로)  
  2번 수포자 : 2,1,2,3,2,4,2,5,2,1,2,3 ... (length : 7)
  3번 수포자 : 3,3,1,1,2,2,4,4,5,5, 3,3,1,1,2,2 ... (length : 10    )
 

  #제한 조건
  - 시험은 최대 10,000 문제로 구성되어있다. 
  - 정답은 1,2,3,4,5 중 하나
  - 가장 높은 점수를 받은 사람이 여럿일 경우, return하는 값을 오름차순으로 정렬.
  
 */

let supo = [
  [1, 2, 3, 4, 5],
  [22, 1, 2, 3, 2, 4, 2, 5],
  [3, 3, 1, 1, 2, 2, 4, 4, 5, 5],
];

function solution(answers) {
  let answer;

  return answer;
}

solution([1, 2, 3, 4, 5]);
solution([1, 3, 2, 4, 2]);

// 출처 : https://programmers.co.kr/learn/courses/30/lessons/42840
